In [2]:
%reload_ext sql

In [3]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

In [4]:
%%sql
SELECT *
FROM import_coursemeetingsF14
LIMIT 10

 * sqlite:///CourseData.db
Done.

[('70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 ('70384', 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 ('70384', 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

In [31]:
%%sql
DROP TABLE IF EXISTS coursemeetings;
CREATE TABLE coursemeetings (
    term TEXT NOT NULL,
    crn INTEGER NOT NULL,
    location TEXT NOT NULL,
    day TEXT NOT NULL,
    start TEXT NOT NULL,
    end TEXT NOT NULL);

 * sqlite:///CourseData.db
Done.
Done.

[]

In [32]:
%%sql
select * from coursemeetings
limit 10;

 * sqlite:///CourseData.db
Done.

[]

In [33]:
%%sql
INSERT INTO coursemeetings (term, crn, location, day, start, end)
SELECT term, crn, location, day, start, end
FROM import_coursemeetingsF14

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: term [SQL: 'INSERT INTO coursemeetings (term, crn, location, day, start, end)\nSELECT term, crn, location, day, start, end\nFROM import_coursemeetingsF14'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [25]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF15

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: term [SQL: 'INSERT INTO coursemeetings (term,crn,location,day,start,end)\nSELECT term,crn,location,day,start,end\nFROM import_coursemeetingsF15'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [26]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(0,)]

In [27]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF16

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: term [SQL: 'INSERT INTO coursemeetings (term,crn,location,day,start,end)\nSELECT term,crn,location,day,start,end\nFROM import_coursemeetingsF16'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [28]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(0,)]

In [29]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF17

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: term [SQL: 'INSERT INTO coursemeetings (term,crn,location,day,start,end)\nSELECT term,crn,location,day,start,end\nFROM import_coursemeetingsF17'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [106]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(125835,)]

In [107]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF18

 * sqlite:///CourseData.db
33440 rows affected.

[]

In [108]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(159275,)]

In [109]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS15

 * sqlite:///CourseData.db
31936 rows affected.

[]

In [110]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(191211,)]

In [111]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS16

 * sqlite:///CourseData.db
33132 rows affected.

[]

In [112]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(224343,)]

In [113]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS17

 * sqlite:///CourseData.db
32405 rows affected.

[]

In [114]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(256748,)]

In [115]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS18

 * sqlite:///CourseData.db
31711 rows affected.

[]

In [116]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(288459,)]

In [117]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS19

 * sqlite:///CourseData.db
28348 rows affected.

[]

In [118]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(316807,)]

In [119]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSB17

 * sqlite:///CourseData.db
5 rows affected.

[]

In [120]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(316812,)]

In [121]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU15

 * sqlite:///CourseData.db
2584 rows affected.

[]

In [122]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(319396,)]

In [123]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU16

 * sqlite:///CourseData.db
3007 rows affected.

[]

In [124]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(322403,)]

In [125]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU17

 * sqlite:///CourseData.db
2666 rows affected.

[]

In [126]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(325069,)]

In [127]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU18

 * sqlite:///CourseData.db
2624 rows affected.

[]

In [44]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(327693,)]

In [128]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW15

 * sqlite:///CourseData.db
101 rows affected.

[]

In [129]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(327794,)]

In [130]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW16

 * sqlite:///CourseData.db
106 rows affected.

[]

In [131]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(327900,)]

In [132]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW17

 * sqlite:///CourseData.db
213 rows affected.

[]

In [133]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(328113,)]

In [134]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW18

 * sqlite:///CourseData.db
93 rows affected.

[]

In [135]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData.db
Done.

[(328206,)]

In [30]:
%%sql
DROP TABLE courses;
CREATE TABLE courses (
    term TEXT NOT NULL,
    crn INTEGER NOT NULL,
    catalog_id TEXT NOT NULL,
    section TEXT NOT NULL,
    credits FLOAT NOT NULL,
    title TEXT NOT NULL,
    meetings TEXT NOT NULL,
    timecodes TEXT NOT NULL,
    primary_instructor TEXT NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL);

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: courses [SQL: 'DROP TABLE courses;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [137]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF14

 * sqlite:///CourseData.db
1522 rows affected.

[]

In [138]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF15

 * sqlite:///CourseData.db
1475 rows affected.

[]

In [139]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(2997,)]

In [140]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF16

 * sqlite:///CourseData.db
1491 rows affected.

[]

In [141]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(4488,)]

In [142]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF17

 * sqlite:///CourseData.db
1479 rows affected.

[]

In [143]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF18

 * sqlite:///CourseData.db
1519 rows affected.

[]

In [144]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(7486,)]

In [145]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS15

 * sqlite:///CourseData.db
1738 rows affected.

[]

In [146]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS16

 * sqlite:///CourseData.db
1698 rows affected.

[]

In [147]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS17

 * sqlite:///CourseData.db
1721 rows affected.

[]

In [148]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS18

 * sqlite:///CourseData.db
1719 rows affected.

[]

In [149]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(14362,)]

In [150]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS19

 * sqlite:///CourseData.db
1473 rows affected.

[]

In [151]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(15835,)]

In [152]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSB17

 * sqlite:///CourseData.db
1 rows affected.

[]

In [153]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU15

 * sqlite:///CourseData.db
316 rows affected.

[]

In [154]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU16

 * sqlite:///CourseData.db
310 rows affected.

[]

In [155]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU17

 * sqlite:///CourseData.db
285 rows affected.

[]

In [156]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU18

 * sqlite:///CourseData.db
313 rows affected.

[]

In [157]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(17060,)]

In [158]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW15

 * sqlite:///CourseData.db
25 rows affected.

[]

In [159]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW16

 * sqlite:///CourseData.db
28 rows affected.

[]

In [160]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW17

 * sqlite:///CourseData.db
24 rows affected.

[]

In [161]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW18

 * sqlite:///CourseData.db
28 rows affected.

[]

In [162]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData.db
Done.

[(17165,)]

In [6]:
%%sql
DROP TABLE course_catalog;
CREATE TABLE course_catalog (
    program_code TEXT NOT NULL,
    program_name TEXT NOT NULL,
    catalog_id TEXT PRIMARY KEY,
    course_title TEXT NOT NULL,
    credits TEXT,
    prereqs TEXT,
    coreqs TEXT,
    fees TEXT,
    attributes TEXT,
    description TEXT NOT NULL);

UsageError: Cell magic `%%sql` not found.